### Filtros avanzados con SQL desde Python

#### 1. Trabajamos con SQL

In [2]:
import pyodbc
import pandas as pd

In [3]:
#Creamos una variable donde guardamos los datos de conexion del servidor SQL
server ="DESKTOP-GU4H9H0\SQLEXPRESS"

In [4]:
conexion =pyodbc.connect(driver='{SQL Server}', host =server, database = "DB_PYTHON")
print("conexion exitosa")

conexion exitosa

In [6]:
#Buscamos al mexicano que llego antes que sus compatriotas a la meta

Hombre_mex_veloz=pd.read_sql("SELECT Min(Tiempo) FROM MaratonNY_Python WHERE Genero='Male' AND Pais ='Mex'", conexion)

C:\Users\pc\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

In [11]:
#Buscamos a las mujeres que sean mas veloces que el Mexicano que haya llegado antes que sus compatriotas a la meta

Mujeres_veloces= pd.read_sql("SELECT Genero, Tiempo, Pais FROM MaratonNY_Python WHERE Genero='Female' AND Tiempo <= (SELECT Min(Tiempo) FROM MaratonNY_Python WHERE Genero='Male' AND Pais ='Mex')", conexion)

#### 3. Accedemos a los valores del dataframe con loc e iloc

In [8]:
Hombre_mex_veloz

0  207.016667

In [9]:
Hombre_mex_veloz.iloc [0][0]

207.0166667

In [12]:
Mujeres_veloces

   Genero      Tiempo Pais
0  Female  175.533333   NY
1  Female  187.733333   CA
2  Female  190.933333   MN
3  Female  193.316667   MN
4  Female  194.950000   NY
5  Female  201.350000   WA
6  Female  204.933333   NY